#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/zemoso-int/tf-devops-zemoso-vpn-infra/runs/run-gouDd7bXp9RowoEK

Waiting for the plan to start...

Terraform v0.15.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.z_sec_vpc: Refreshing state... [id=vpc-036ecaa99a2434947]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.z_sec_private_subnet will be created
  + resource "aws_subnet" "z_sec_private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.20.30.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-private-subnet"
          + "Owner"      = "terraform"
        }
      + tags_all                        = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-private-subnet"
          + "Owner"      = "terraform"
        }
      + vpc_id                          = "vpc-036ecaa99a2434947"
    }

  # aws_subnet.z_sec_public_subnet will be created
  + resource "aws_subnet" "z_sec_public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.20.20.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-public-subnet"
          + "Owner"      = "terraform"
        }
      + tags_all                        = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-public-subnet"
          + "Owner"      = "terraform"
        }
      + vpc_id                          = "vpc-036ecaa99a2434947"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @suraj-zemoso, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*